blog/2021/01/17/emacs-as-a-static-site-generator.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs as a static site generator</title>
<meta name="author" content="Adam Schwartz" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../../../../css/style.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
</head>
<body>
<div id="preamble" class="status">
<p>Published:&nbsp;January 17, 2021</p>
</div>
<div id="content" class="content">
<ul class="org-ul nav">
<li><a href="../../../../index.html">About</a></li>
<li><a href="../../../index.html">Blog</a></li>
<li><a href="../../../../ceramics/index.html">Ceramics</a></li>
<li><a href="https://github.com/anschwa">Github</a></li>
</ul>

<div id="outline-container-orgaa8ca28" class="outline-2">
<h2 id="orgaa8ca28">Emacs as a Static Site Generator</h2>
<div class="outline-text-2" id="text-orgaa8ca28">
<p>
I&rsquo;ve been hosting my website on <a href="https://pages.github.com/">GitHub Pages</a> since 2014. Over the years
I have tended to rewrite my website whenever I was learning a new
programming language.
</p>

<p>
I started out with a &ldquo;pure&rdquo; HTML+CSS website and eventually moved on
to Python, where I used the <a href="https://pythonhosted.org/Frozen-Flask/">Frozen-Flask</a> package to bundle my Flask
app into a set of static files. As time went on, I started writing my
own static site generators: first in Bash+Pandoc, then Common-Lisp,
and later Go(lang).
</p>

<p>
Overall I have enjoyed writing my own static site generators and think
it&rsquo;s a great project for exploring a new programming language. In
fact, whenever I&rsquo;ve tried migrating to one of the popular options like
<a href="https://github.com/gohugoio/hugo">Hugo</a>, I ultimately went back to doing it myself because I hated
dealing with auto-generated files, customizing themes, and digging
through incomplete documentation.
</p>

<p>
I have been using Emacs and <a href="https://orgmode.org/">Org Mode</a> for a long time but never
explored the <code>org-publish</code> functionality. It&rsquo;s far from perfect, but
it&rsquo;s incredibly convenient. Like most things Emacs, <code>org-publish</code> can
be configured to do just about anything. So far I only use it to
generate this website, but my configuration can be easily extended to
handle several different projects.
</p>

<p>
This website is generated from Emacs using <code>M-x org-publish</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(<span style="color: nil; font-weight: bold;">require</span> '<span style="color: nil;">ox-publish</span>)</code>
<code></code>
<code>(<span style="color: nil; font-weight: bold;">defvar</span> <span style="color: nil;">my/website-org-path</span> <span style="color: #0f3d8c;">"~/src/anschwa.github.io"</span>)</code>
<code>(<span style="color: nil; font-weight: bold;">defvar</span> <span style="color: nil;">my/website-org-base-directory</span> (concat my/website-org-path <span style="color: #0f3d8c;">"/org/"</span>))</code>
<code>(<span style="color: nil; font-weight: bold;">defvar</span> <span style="color: nil;">my/website-org-publishing-directory</span> (concat my/website-org-path <span style="color: #0f3d8c;">"/public_html/"</span>))</code>
<code>(<span style="color: nil; font-weight: bold;">defvar</span> <span style="color: nil;">my/website-head-extra</span></code>
<code>  (<span style="color: nil; font-weight: bold;">let</span> ((viewport <span style="color: #0f3d8c;">"&lt;meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" /&gt;"</span>))</code>
<code>    (concat viewport <span style="color: #0f3d8c;">"\n"</span>)))</code>
<code></code>
<code>(<span style="color: nil; font-weight: bold;">setq</span> org-html-metadata-timestamp-format <span style="color: #0f3d8c;">"%Y-%m-%d"</span>)</code>
<code>(<span style="color: nil; font-weight: bold;">setq</span> org-html-htmlize-output-type 'inline-css) <span style="color: #5e3a20;">; </span><span style="color: #5e3a20;">Uses current theme for syntax highlighting</span></code>
<code>(<span style="color: nil; font-weight: bold;">setq</span> org-publish-project-alist</code>
<code>      `(</code>
<code>        (<span style="color: #0f3d8c;">"website"</span> <span style="color: nil; font-weight: bold;">:components</span> (<span style="color: #0f3d8c;">"website-content"</span> <span style="color: #0f3d8c;">"website-static"</span>))</code>
<code>         (<span style="color: #0f3d8c;">"website-content"</span></code>
<code>          <span style="color: nil; font-weight: bold;">:base-extension</span> <span style="color: #0f3d8c;">"org"</span></code>
<code>          <span style="color: nil; font-weight: bold;">:base-directory</span> ,my/website-org-base-directory</code>
<code>          <span style="color: nil; font-weight: bold;">:publishing-directory</span> ,my/website-org-publishing-directory</code>
<code>          <span style="color: nil; font-weight: bold;">:publishing-function</span> org-html-publish-to-html</code>
<code>          <span style="color: nil; font-weight: bold;">:recursive</span> t</code>
<code></code>
<code>          <span style="color: #5e3a20;">;; </span><span style="color: #5e3a20;">Disable some defaults</span></code>
<code>          <span style="color: nil; font-weight: bold;">:html-link-home</span> <span style="color: #0f3d8c;">""</span></code>
<code>          <span style="color: nil; font-weight: bold;">:html-link-up</span> <span style="color: #0f3d8c;">""</span></code>
<code>          <span style="color: nil; font-weight: bold;">:html-head-include-default-style</span> nil</code>
<code>          <span style="color: nil; font-weight: bold;">:html-head-include-scripts</span> nil</code>
<code>          <span style="color: nil; font-weight: bold;">:html-preamble</span> nil</code>
<code>          <span style="color: nil; font-weight: bold;">:html-postamble</span> nil</code>
<code></code>
<code>          <span style="color: #5e3a20;">;; </span><span style="color: #5e3a20;">Custom options</span></code>
<code>          <span style="color: nil; font-weight: bold;">:headline-levels</span> 4</code>
<code>          <span style="color: nil; font-weight: bold;">:language</span> <span style="color: #0f3d8c;">"en"</span></code>
<code>          <span style="color: nil; font-weight: bold;">:html-html5-fancy</span> t</code>
<code>          <span style="color: nil; font-weight: bold;">:html-head-extra</span> ,my/website-head-extra</code>
<code>          <span style="color: nil; font-weight: bold;">:with-date</span> t</code>
<code>          <span style="color: nil; font-weight: bold;">:with-emphasize</span> t              <span style="color: #5e3a20;">; </span><span style="color: #5e3a20;">*:t</span></code>
<code>          <span style="color: nil; font-weight: bold;">:with-smart-quotes</span> t           <span style="color: #5e3a20;">; </span><span style="color: #5e3a20;">*:t</span></code>
<code>          <span style="color: nil; font-weight: bold;">:with-sub-superscript</span> nil      <span style="color: #5e3a20;">; </span><span style="color: #5e3a20;">^:nil</span></code>
<code>          <span style="color: nil; font-weight: bold;">:with-toc</span> nil                  <span style="color: #5e3a20;">; </span><span style="color: #5e3a20;">toc:nil</span></code>
<code>          <span style="color: nil; font-weight: bold;">:section-numbers</span> nil           <span style="color: #5e3a20;">; </span><span style="color: #5e3a20;">num:nil</span></code>
<code>          <span style="color: nil; font-weight: bold;">:html-preamble</span> <span style="color: #0f3d8c;">"&lt;p&gt;Published: %d&lt;/p&gt;"</span></code>
<code>          <span style="color: nil; font-weight: bold;">:html-postamble</span> <span style="color: #0f3d8c;">"&lt;p&gt;Last updated: %C&lt;/p&gt;"</span></code>
<code>          <span style="color: nil; font-weight: bold;">:html-wrap-src-lines</span> t)</code>
<code></code>
<code>         (<span style="color: #0f3d8c;">"website-static"</span></code>
<code>          <span style="color: nil; font-weight: bold;">:base-directory</span> ,my/website-org-base-directory</code>
<code>          <span style="color: nil; font-weight: bold;">:publishing-directory</span> ,my/website-org-publishing-directory</code>
<code>          <span style="color: nil; font-weight: bold;">:base-extension</span> <span style="color: #0f3d8c;">"css</span><span style="color: #5d5000;">\\</span><span style="color: #7f002f;">|</span><span style="color: #0f3d8c;">js</span><span style="color: #5d5000;">\\</span><span style="color: #7f002f;">|</span><span style="color: #0f3d8c;">jpg</span><span style="color: #5d5000;">\\</span><span style="color: #7f002f;">|</span><span style="color: #0f3d8c;">png</span><span style="color: #5d5000;">\\</span><span style="color: #7f002f;">|</span><span style="color: #0f3d8c;">pdf"</span></code>
<code>          <span style="color: nil; font-weight: bold;">:publishing-function</span> org-publish-attachment</code>
<code>          <span style="color: nil; font-weight: bold;">:recursive</span> t)))</code>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Last&nbsp;updated:&nbsp;2023-01-12</p>
</div>
</body>
</html>
